content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Small Step Semantics
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: small-step-semantics
:END:

Today we will talk about *small-step semantics*, also called *transition
semantics*, or even *operational semantics*. The idea with this semantics is
that we model what one step of computation looks like, and use that to describe
the meaning of a program.

One important concept that comes up with this form is the *Church-Rosser theorem*.

*** Videos

- [[/videos/small-step-semantics][Small Step Semantics]]
- [[/videos/church-rosser-property][The Church-Rosser Property]]
- [[https://mediaspace.illinois.edu/media/t/1_te2cdxt7][Activity Walkthrough (Spring 2022)]]


