content/lectures/small-step-semantics.md
+++
title = "Small Step Semantics"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

Today we will talk about **small-step semantics**, also called **transition
semantics**, or even **operational semantics**. The idea with this semantics is
that we model what one step of computation looks like, and use that to describe
the meaning of a program.

One important concept that comes up with this form is the **Church-Rosser theorem**.


## Videos {#videos}

-   [Small Step Semantics](/videos/small-step-semantics)
-   [The Church-Rosser Property](/videos/church-rosser-property)
-   [Activity Walkthrough (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_te2cdxt7)
